Revit 2027 API
MultiReferenceAnnotationOptions.SetAdditionalReferencesToDimension Method
 Sets the additional references which the dimension will witness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAdditionalReferencesToDimension(
	IList<Reference> referencesToDimension
)
Public Sub SetAdditionalReferencesToDimension (
	referencesToDimension As IList(Of Reference)
)
public:
void SetAdditionalReferencesToDimension(
	IList<Reference^>^ referencesToDimension
)
member SetAdditionalReferencesToDimension :
        referencesToDimension : IList<Reference> -> unit
Parameters
referencesToDimension IList<Reference>
 The additional references which the dimension will witness.
Exceptions
Exception | Condition
ArgumentException |  Some references come from elements which directly match the reference category required by the MultiReferenceAnnotationType. For those elements please use SetElementsToDimension.
ArgumentNullException |  A non-optional argument was null
Remarks
 The additional references to dimension cannot come from the same category as the MultiReferenceAnnotationType's reference category.
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace